<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PermissionsSeeder extends Seeder
{
    //php artisan db:seed --class=PermissionsSeeder

    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $permissions = [
            // Dashboard
            'Перегляд панелі керування',

            // Products
            'Перегляд продуктів',
            'Створення продуктів',
            'Редагування продуктів',
            'Видалення продуктів',

            // Categories
            'Перегляд категорій',
            'Створення категорій',
            'Редагування категорій',
            'Видалення категорій',

            // Orders
            'Перегляд замовлень',
            'Створення замовлень',
            'Редагування замовлень',
            'Видалення замовлень',

            // Статуси замовлень
            'Перегляд статусів замовлень',
            'Створення статусів замовлень',
            'Редагування статусів замовлень',
            'Видалення статусів замовлень',

            //Методи оплат
            'Перегляд методів оплат',
            'Створення методів оплат',
            'Редагування методів оплат',
            'Видалення методів оплат',

            // Методи доставки
            'Перегляд методів доставки',
            'Створення методів доставки',
            'Редагування методів доставки',
            'Видалення методів доставки',

            // Групи
            'Перегляд груп',
            'Створення груп',
            'Редагування груп',
            'Видалення груп',
            'Призначення груп',

            // Users
            'Перегляд користувачів',
            'Створення користувачів',
            'Редагування користувачів',
            'Видалення користувачів',
            'Призначення ролей',

            // Roles and Permissions
            'Перегляд ролей',
            'Створення ролей',
            'Редагування ролей',
            'Видалення ролей',
            'Перегляд дозволів',
            'Створення дозволів',
            'Видалення дозволів',
        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(['name' => $permission]);
        }
    }
}
